app/controllers/contracts_controller.rb

  def index
    @contracts = Contract.all
---
SELECT "contracts".* FROM "contracts"

  def new
    @contract = Contract.new
    @contract.service = Service.find(params.fetch(:service_id))
---
SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @contract = Contract.new(contract_params)

    respond_to do |format|
      if @contract.save
        payment = Payment.new
        payment.contract = @contract
        payment.save!
---
INSERT INTO "contracts" ("start_time", "observations", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["start_time", "2019-04-02 17:46:00"], ["observations", ""], ["created_at", "2019-04-02 17:47:11.734531"], ["updated_at", "2019-04-02 17:47:11.734531"]]
INSERT INTO "payments" ("created_at", "updated_at", "contract_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-04-10 22:41:55.396776"], ["updated_at", "2019-04-10 22:41:55.396776"], ["contract_id", 3]]

  def update
    respond_to do |format|
      if @contract.update(contract_params)
---
UPDATE "contracts" SET "observations" = $1, "recurring" = $2, "updated_at" = $3 WHERE "contracts"."id" = $4

  def destroy
    @contract.destroy
---
DELETE FROM "contracts" WHERE "contracts"."id" = $1  [["id", 2]]

    def set_contract
      @contract = Contract.find(params[:id])
---
SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]