app/controllers/services_controller.rb

  def index
    @services = Service.all
---
SELECT "services".* FROM "services"

  def create
    @service = current_user.services.new(service_params)

    respond_to do |format|
      if @service.save
---
INSERT INTO "services" ("description", "title", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "21"], ["title", "123"], ["price", "123.0"], ["user_id", 1], ["created_at", "2019-04-01 00:05:03.756832"], ["updated_at", "2019-04-01 00:05:03.756832"]]

    def set_service
      @service = Service.find(params[:id])
---
SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]